from tinygrad import Tensor
import time
"""
N = 8192

flop = N*N*2*N
print(f"{flop / 1e9:.2f} GFLOP")

for t in range(1):
    print(">>>> HERE 1")
    t1 = Tensor.rand(N, N).realize()
    print(">>>> HERE 2")
    t2 = Tensor.rand(N, N).realize()
    print(">>>> HERE 3")

    st = time.monotonic()
    print(">>>> HERE 4")
    t3 = t1.dot(t2)
    print(">>>> HERE 5")
    t3.realize()
    print(">>>> HERE 6")
    et = time.monotonic()
    print(">>>> HERE 7")
    s = (et-st)
    print(">>>> HERE 8")
    print(f"{flop/s * 1e-9:.2f} GLOPS")
    print(">>>> HERE 9")
"""
from tinygrad import Tensor

a = Tensor.empty(4, 4)
b = a + 1
b.realize()


import functools
from tinygrad import Tensor, nn
from extra.models.llama import sample

import tokenizers
args = {
    "tokenizer": "/home/hyeondg/models/tokenizer.json"
}
tokenizer = tokenizers.Tokenizer.from_file(str(args['tokenizer']))

text = """
아래는 사과나무를 심는 일반적인 절차입니다. 한국어로 익히면 이해가 빠질
것 같습니다.
1. ** 위치 선택** (장소 선정) : - 적당한 타이스(적은 수영량의 장기 헌신 등)과 밝은 햇음
이 있는 지역에서 심如果￿想￿￿￿得更好。
2. ** 땅 준비** (토양 개발) : - 깊고排水형이 좋은 반원形 심장을 파합니다. - 지하수의
흐름을 개선하기 위해 필요한 수분과 비료를 토양에 추가할 수 있습니다.
(omitted)
5. ** 청소 및 조치** (코드 및 보조물) : - 오랜 시간이 지남에 따라, 신생 나무가 생길 때마다
정기적인 심장 청소 작업과 수분 관리가 필요합니다. - 흔히 사용되는 보조 도구에는 토양
상태 모니터, 수분 분석기 및 적절한 재료인 미세먼지 기공재 등을 포함할 수 있습니다.
이렇게 나무를 심는 일반적인 절차입니다. 하지만 실제 작동은 지역과 해당 사람의 관리
능력에 따라 변할 수 있습니다.
"""

from typing import Callable
from examples.trie_utils import Trie
from pprint import pprint
tokens = tokenizer.encode(text).tokens
transform: Callable[[str], str]  = lambda t: repr(bytes(t, encoding='utf8'))
tokens = list(map(transform, tokens))
print(" -- ".join(tokens))

trie = Trie()
dataset = [
"或","いつまでも","いなむしろ","いごく","みたらい","あと","けん","か","かい","し","うる","おう","おく","おくる","おこる","おさめる","納める","伯父さん","小父さん","叔父さん","お嬢さん","お互い","落着く","落る","お出掛け","お手伝いさん","押える","行う","起す","お子さん","~おき","お代わり","おかけください","オーバーコート","オーバー","オートバイ","オートメーション","大通り","オーケストラ","おお~","おいでになる","甥[おい]","御~","~園","~円","エレベーター","エネルギー","エスカレーター","上~","売行き","売上","打合せ","嘘","薄める","薄暗い","受取り","受付","浮ぶ","ウエートレス","ウール","ウーマン","ウイスキー","インタビュー","インク・インキ","~員","煎る","入口","イメージ","いつでも","いってきます","いってまいります","いってらっしゃい","いっていらっしゃい","一段と","イコール","いくら~ても","幾~","いい・よい","~位","あんなに","有る","有難い","現れる","現れ","著す","現す","編物","アパート","あの（接。感）저,","アナウンサー","暖・温める","暖・温まる","暖・温かい","明くる~","飽くまで","アクセサリー","明き・空き","明い","アイデア・アイディア","相手あいて","アイスクリーム","あ（っ","おどかす","おとうと","おとうさん","おと","おっと","おっしゃる","おだやか","おそわる","おそろしい","おそれる","おそらく","おそい","おせん","おす","おしゃべり","おしゃれ","おじぎ","おしえる","おしいれ","おじいさん","おしい","しゅくふ","おじ","おさない","おこたる","おくれる","おくりもの","おくりがな","おくじょう","おくさん","おくがい","おきる","おぎなう","おき","おがむ","おかず","おかす","おかしい","おかげ","おかあさん","おか","おおよそ","おおや","おおぜい","おおざっぱ","おおきい","おおいに","おおい","おえる","おうよう","おうべい","おうふく","おうだん","おうたい","おうせつ","おうじる","おうじょ","おうじ","おうさま","おうえん","オイル","おいつく","おいしい","おいこす","おいかける","お","えんりょ","えんぴつ","えんとつ","えんちょう","えんそく","えんそう","えんぜつ","エンジン","えんじょ","えんしゅう","えんげき","えんげい","えんぎ","えんき","えんかい","セメンえん","えらぶ","えらい","エプロン","えのぐ","エチケット","じ","えきたい","うまや","えがく","えがお","えいわ","えいよう","えいぶん","えいせい","えいご","えいぎょう","えいきょう","とわ","えいが","えいえん","え","うんどう","うんてん","うんが","うん","うわさ","うわぎ","うろうろ","うれる","うれしい","うるさい","うりば","うりきれる","うりきれ","うらやむ","うらやましい","うらむ","うらみ","うらなう","うらぐち","うらぎる","うらがえす","り","うやまう","うずめる","ばい","うむ","うまれる","うまれ","うまい","ば","うばう","うなる","うなずく","うどん","わん","うつる","うったえる","うつす","うつくしい","うっかり","うつ","うちゅう","うちけす","ない","うたがう","うたう","すすき","うしなう","ぎゅう","と","うごかす","うける","うけもつ","うけとる","うけたまわる","うく","うかべる","うかがう","うがい","ぎょ","かつえる","うえる","うえき","かみ","いんりょく","いんよう","いんたい","いんしょう","いんさつ","いわゆる","いわば","いわう","いわい","がん","りょくしょく","いれる","いれもの","いる","ゐる","いりょう","いらっしゃる","いらっしゃい","いらいら","いらい","いよいよ","いやがる","いな","いも","いみ","いまにも","いまに","いま","こん","いふく","いはん","いばる","いのる","いのち","いねむり","いなか","いない","じゅうしまい","じゅうけいてい","いどう","いど","いてん","いつも","いっぽう","いっぱん","いつのまにか","いちじょう","いつつ","いっち","いったん","いったい","いっそう","いっせい","いっしょうけんめい","いっしょう","いっしょ","いっしゅん","いっしゅ","おととし","おとつい","いっか","いつか","いつ","いちりゅう","しじょう","いちどに","いちど","いちじ","いちおう","いちいち","いち","いたる","いたむ","いたみ","いただく","いたずら","いたす","いだく","いだい","いたい","いた","いそぐ","いそがしい","いぜん","いずれ","いずみ","いす","いじわる","いしょくじゅう","いじょう","いしゃ","いじめる","いしき","いじ","いし","こく","いさましい","いこう","いご","いけん","いけばな","いけない","いけ","いくら","いくぶん","いくつ","いくじ","ゆく","いきる","いきもの","いきなり","いきおい","いきいき","いぎ","いき","ゆき","いがく","いかが","いがい","いか","ゆう","いいん","いいつける","いいだす","い","あんまり","あんない","あんな","アンテナ","あんてい","あんぜん","あんしん","あんき","あんがい","あんい","あん","あわれ","あわてる","あわただしい","あわせる","あぶく","あれる","あれこれ","アルバム","アルバイト","あるく","あるいは","ある","ひょうす","あらゆる","あらためる","あらためて","あらた","あらそう","あらすじ","らん","あらう","あらい","あやまる","あやまり","あやしい","あやうい","アメリカ","あめ","りょくう","あむ","あまる","あまり","あまやかす","あまど","あまい","あふれる","アフリカ","やに","ゆ","あぶない","あびる","あばれる","あね","あに","あなた","あな","あてる","あてはめる","あてはまる","あてな","あつめる","たかる","あつまり","あっしゅく","あつかましい","あつかう","あつい","あちらこちら","あっち","あちら","あちこち","あたる","あたりまえ","わたり","あたらしい","かしら","あたえる","あそび","あそこ","あせ","あずける","あずかる","あした","あじわう","あしもと","あしあと","アジア","あじ","あし","あさねぼう","あさって","あさい","あさ","あこがれる","あげる","あける","あけがた","あくま","あくび","アクセント","あくしゅ","すく","ひらく","あきれる","あきる","あきらめる","あきらか","しゅう","あかんぼう","のぼる","あかり","あかちゃん","あかい","せき","あおじろい","あおぐ","あおい","ろくしょう","アウト","あう","アイロン","あいまい","あいにく","かん","あいする","あいず","あいじょう","あいさつ","あいかわらず","あい"
]

for i in dataset:
  trie.add(i)

pprint(trie.data)

